In [1]:
import pandas

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
d=(1,2,3,4,5,6,7,8,9)

type(d)

tuple

In [5]:
r={1,2,3,4,5,6,7,8,9}
type(r)

set

In [6]:
l=[1,2,3,4,5,6,7,8,9,0]
type(l)

list

In [8]:
ser=pd.Series()

C:\Users\arunk\AppData\Local\Temp\ipykernel_16260\1876242370.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

In [9]:
ser

Series([], dtype: float64)

In [10]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90])

In [11]:
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [12]:
ser=pd.Series([10,20.5,'4'])

In [13]:
ser

0      10
1    20.5
2       4
dtype: object

In [14]:
f={'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]}

In [15]:
print(f)

{'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [16]:
df=pd.DataFrame(f)

In [17]:
print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [20]:
df['D']='One Two Ten'.split()

In [21]:
df

   A  B  C    D
0  1  4  7  One
1  2  5  8  Two
2  3  6  9  Ten

In [22]:
df["E"]=[10,20,30]

In [23]:
df

   A  B  C    D   E
0  1  4  7  One  10
1  2  5  8  Two  20
2  3  6  9  Ten  30

In [35]:
nan={'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[5,6,8]}

In [36]:
nan

{'A': [1, 2, nan], 'B': [4, nan, nan], 'C': [5, 6, 8]}

In [37]:
df=pd.DataFrame(nan)

In [38]:
df

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6
2  NaN  NaN  8

In [41]:
df['D']='10 20 30'.split()

In [42]:
df

     A    B  C   D
0  1.0  4.0  5  10
1  2.0  NaN  6  20
2  NaN  NaN  8  30

In [43]:
df.dropna(axis=1)

   C   D
0  5  10
1  6  20
2  8  30

In [44]:
df

     A    B  C   D
0  1.0  4.0  5  10
1  2.0  NaN  6  20
2  NaN  NaN  8  30

In [45]:
df.dropna()

     A    B  C   D
0  1.0  4.0  5  10

In [46]:
df

     A    B  C   D
0  1.0  4.0  5  10
1  2.0  NaN  6  20
2  NaN  NaN  8  30

In [47]:
df.fillna(50)

      A     B  C   D
0   1.0   4.0  5  10
1   2.0  50.0  6  20
2  50.0  50.0  8  30

In [48]:
df

     A    B  C   D
0  1.0  4.0  5  10
1  2.0  NaN  6  20
2  NaN  NaN  8  30

In [50]:
df.fillna(value=50)

      A     B  C   D
0   1.0   4.0  5  10
1   2.0  50.0  6  20
2  50.0  50.0  8  30

In [51]:
df

     A    B  C   D
0  1.0  4.0  5  10
1  2.0  NaN  6  20
2  NaN  NaN  8  30